In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\rojalin\anaconda3\lib\site-packages (8.0.27)
Collecting protobuf>=3.0.0
  Downloading protobuf-4.21.9-cp38-cp38-win_amd64.whl (525 kB)
Installing collected packages: protobuf
Successfully installed protobuf-4.21.9

In [8]:
import mysql.connector
import pandas as pd

In [9]:
import pandas as pd

In [6]:
# creating a cursor object
cursorObject = connection.cursor()

# creating table
Customers =     """CREATE TABLE Customers (
                   CUSTOMER_NAME  VARCHAR(20) NOT NULL,
                   CUSTOMER_ID INT NOT NULL,
                   AGE INT,
                   PHNO INT,
                   ORDER_ID INT NOT NULL
                   )"""
  
# table created
cursorObject.execute(Customers)

In [10]:
connection = mysql.connector.connect(
  host="localhost",
  user="root",
  password="ROjalin@89",database="e_commerce"
)
print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001B8C2BE88B0>

In [43]:
mycursor = connection.cursor()
mycursor.execute("create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))")

In [44]:
mycursor= connection.cursor()
mycursor.execute("create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))")

In [45]:
mycursor=connection.cursor()
mycursor.execute("create table category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))")

In [46]:
mycursor=connection.cursor()
mycursor.execute("create table product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))")

In [47]:
mycursor=connection.cursor()
mycursor.execute("create table product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))")

In [51]:
mycursor=connection.cursor()
mycursor.execute("CREATE TABLE orders (`ORD_ID` INT NOT NULL,`ORD_AMOUNT` INT NOT NULL,`ORD_DATE` DATE,`CUS_ID` INT NOT NULL,`PROD_ID` INT NOT NULL, PRIMARY KEY (`ORD_ID`),FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`),FOREIGN KEY (`PROD_ID`) REFERENCES PRODUCT_DETAILS(`PROD_ID`))")

In [53]:
mycursor=connection.cursor()
mycursor.execute("CREATE TABLE rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))")

In [54]:
insert_query = "INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"
val = [(1,"Rajesh Retails","Delhi",'1234567890'),
       (2,"Appario Ltd.","Mumbai",'2589631470'),
       (3,"Knome products","Banglore",'9785462315'),
       (4,"Bansal Retails","Kochi",'8975463285'),
       (5,"Mittal Ltd.","Lucknow",'7898456532')]

   
mycursor.executemany(insert_query, val)
connection.commit()

In [55]:
insert_query = "INSERT INTO customer(CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER) VALUES(%s , %s , %s , %s , %s)"
val=[( 1,"AAKASH","9999999999","DELHI",'M'),
     ( 2 ," AMAN","9785463215 "," NOIDA ",'M'),
(3 ,"NEHA", "9999999998","MUMBAI",'F'),
( 4,"MEGHA","9994562399","KOLKATA",'F'),
(5 ,"PULKIT","7895999999","LUCKNOW","M")]
mycursor.executemany(insert_query, val)
connection.commit()

In [56]:
insert_query="INSERT INTO category(CAT_ID,CAT_NAME) VALUES(%s , %s)"
val=[(1,"BOOKS"),
 (2,"GAMES"),  
 (3,"GROCERIES"), 
(4,"ELECTRONICS"),
 (5,"CLOTHES")]
mycursor.executemany(insert_query, val)
connection.commit()

In [11]:
mycursor=connection.cursor()
insert_query="INSERT INTO product(PRO_ID,PRO_NAME,PRO_DESC,CAT_ID) VALUES(%s , %s , %s ,%s)"
val=[(1,"GTA V","DFJDJFDJFDJFDJFJF",'2'),
(2,"TSHIRT", "DFDFJDFJDKFD",'5'), 
(3 ,"ROG LAPTOP","DFNTTNTNTERND",'4'),
(4,"OATS","REURENTBTOTH",'3'),
(5,"HARRY POTTER" ,"NBEMCTHTJTH" ,'1') ]
mycursor.executemany(insert_query, val)
connection.commit()

In [12]:
insert_query="INSERT INTO product_details(PROD_ID , PRO_ID,SUPP_ID,PROD_PRICE) VALUES(%s ,%s , %s , %s)"
val=[(1 ,1,2,1500),
( 2,3,5,30000), 
(3,5,1,3000),
(4,2,3,2500),
(5,4,1,1000)]
mycursor.executemany(insert_query, val)
connection.commit()

In [21]:
insert_query="INSERT INTO orders(ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) VALUES(%s ,%s , %s , %s , %s)"
val=[(20,1500,"2021-10-12",3,5),
(25,30500,"2021-09-16",5 ,2 ),
(26 ,2000,"2021-10-05",1 ,1),
(30,3500,"2021-08-16",4,3),
(50,2000,"2021-10-06",2,1)]
mycursor.executemany(insert_query, val)
connection.commit()

In [22]:
insert_query="INSERT INTO rating(RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) VALUES(%s ,%s , %s , %s )"
val=[(1,2,2,4),
(2,3,4,3),
(3,5,1,5),
(4,1,3 ,2),
(5,4 ,5,4)]
mycursor.executemany(insert_query, val)
connection.commit()

#### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [26]:
query3="""select customer.CUS_GENDER ,count(customer.CUS_GENDER)as count from customer inner join orders on customer.CUS_ID=orders.CUS_ID where orders.ORD_AMOUNT>3000 group by customer.CUS_ID;"""
mycursor.execute(query3)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['CUS_GENDER','count'])
output_df

  CUS_GENDER  count
0          M      1
1          F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2

In [28]:
query4="""select product.PRO_NAME,orders.* from product,orders where orders.CUS_ID=2 and orders.PROD_ID=product.PRO_ID;"""
mycursor.execute(query4)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['PRO_NAME','ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
output_df

  PRO_NAME  ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID
0    GTA V      50        2000  2021-10-06       2        1

### Q5) Display the Supplier details who can supply more than one product.

In [29]:
query5=""" select supplier.* from supplier,product_details where supplier.SUPP_ID in( select product_details.SUPP_ID from product_details group by product_details.SUPP_ID having count(product_details.SUPP_ID)>1) group by supplier.SUPP_ID;"""
mycursor.execute(query5)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [30]:
query6="""select category.* from orders inner join  product_details on orders.PROD_ID=product_details.PROD_ID
inner join product on product.PRO_ID=product_details.PRO_ID
inner join category on category.CAT_ID=product.CAT_ID having  min(orders.ORD_AMOUNT) ;"""
mycursor.execute(query6)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['CAT_ID','CAT_NAME'])
output_df

   CAT_ID CAT_NAME
0       1    BOOKS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [32]:
query7="""select product_details.PROD_ID,product.PRO_NAME from product_details inner join product on product_details.PRO_ID=product.PRO_ID
inner join orders on orders.PROD_ID=product_details.PROD_ID where orders.ORD_DATE>"2021-10-05";"""
mycursor.execute(query7)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['PROD_ID','PROD_NAME'])
output_df

   PROD_ID PROD_NAME
0        5      OATS
1        1     GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [33]:
query8="""select supplier.SUPP_ID,supplier.SUPP_NAME,customer.CUS_NAME,rating.RAT_RATSTARS from rating inner join supplier on rating.SUPP_ID=supplier.SUPP_ID
inner join customer on rating.CUS_ID=customer.CUS_ID order by rating.RAT_RATSTARS desc limit 3;"""
mycursor.execute(query8)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['SUPP_ID','SUPP_NAME','CUS_NAME','RAT_RATSTARS'])
output_df

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [34]:
query9="""select customer.CUS_NAME,customer.CUS_GENDER from customer where customer.CUS_NAME like "A%" or customer.CUS_NAME like "%A";"""
mycursor.execute(query9)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     NEHA          F
2    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [35]:
query10="""select sum(orders.ORD_AMOUNT) as Amount from orders inner join customer on orders.CUS_ID=customer.CUS_ID where customer.CUS_GENDER="M";"""
mycursor.execute(query10)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['Amount'])
output_df

  Amount
0  34500

### Q11) Display all the Customers left outer join with  the orders

In [36]:
query11="""select customer.* from customer left outer join orders on customer.CUS_ID=orders.CUS_ID;"""
mycursor.execute(query11)
output=mycursor.fetchall()
output_df=pd.DataFrame(output,columns =['CUS_ID','CUS_NAME','SUPP_PHONE','CUS_CITY','CUS_GENDER'])
output_df

   CUS_ID CUS_NAME  SUPP_PHONE CUS_CITY CUS_GENDER
0       1   AAKASH  9999999999    DELHI          M
1       2     AMAN  9785463215   NOIDA           M
2       3     NEHA  9999999998   MUMBAI          F
3       4    MEGHA  9994562399  KOLKATA          F
4       5   PULKIT  7895999999  LUCKNOW          M